//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="%d / %d adım gerçekleştiriliyor: Birim belleği oluşturuluyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="%d / %d adım gerçekleştiriliyor: Bootstrap veri tabanı oluşturuluyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="%d / %d adım gerçekleştiriliyor: Talep kuyruğu veri tabanı oluşturuluyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="%d / %d adım gerçekleştiriliyor: Birim belleği indiriliyor. Şimdiye kadar %s / %s alındı.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="%d / %d adım gerçekleştiriliyor: Süresi dolmuş talepler siliniyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="%d / %d gerçekleştiriliyor: Meta veriler yükleniyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="%d / %d adım gerçekleştiriliyor: Talep kuyruğu birleştirme gerçekleştiriliyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="%d / %d adım gerçekleştiriliyor: İşlem birleştirme gerçekleştiriliyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="%d / %d adım gerçekleştiriliyor: Oluşturma ve silme birleştirme gerçekleştiriliyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="%d / %d adım gerçekleştiriliyor:  %s kullanarak %s sorgularını tanımlama işleniyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="%d / %d adım gerçekleştiriliyor: Talepler işleniyor. %s / %s değişiklik talebi gönderiliyor.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="%d / %d adım gerçekleştiriliyor: Değişiklikler yeniden uygulanıyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="%d / %d adım gerçekleştiriliyor: Alınan veriler analiz ediliyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="%d / %d adım gerçekleştiriliyor: Sunucudan veriler alınıyor. Şimdiye kadar %s alındı.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="%d / %d gerçekleştiriliyor: Silinen ilişkiler kaldırılıyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="%d / %d adım gerçekleştiriliyor: RemoveAfterUpload olarak belirlenen talepler kaldırılıyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="%d / %d adım gerçekleştiriliyor: Veriler sunucuya gönderiliyor. Şimdiye kadar %s gönderildi.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="%d / %d adım gerçekleştiriliyor: Birim belleği veri tabanı gönderiliyor. Şimdiye kadar %s / %s gönderildi.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="%d / %d adım gerçekleştiriliyor: Talep kuyruğu veri tabanı gönderiliyor. Şimdiye kadar %s / %s gönderildi.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="%d / %d adım gerçekleştiriliyor: Sunucu ile iletişim başlatılıyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="%d / %d adım gerçekleştiriliyor: Yüklemeden önce talepler önceden işleniyor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="%d / %d adım gerçekleştiriliyor: İndirme için bekleniyor";
